import com.sun.tools.attach.AgentInitializationException;

public class Main {
    public static void main(String[] args) {
    //Створіть Java програму з використанням класів та конструкторів, яка виконує наступні завдання:
        //Створіть клас Person, який представляє особу з такими характеристиками: ім'я, вік та професія. Оголосіть поля для цих характеристик та створіть конструктор класу, який дозволяє встановити значення цих полів при створенні об'єкта класу Person.
        //Створіть об'єкти класу Person для трьох різних осіб, використовуючи конструктор класу Person. Виведіть інформацію про цих осіб на екран.
        //Додайте метод в клас Person, який дозволяє встановити нову професію для особи. Використайте цей метод для зміни професії одного з об'єктів Person, а потім виведіть оновлену інформацію про цю особу на екран.
        //Залийте виконаний проект на свій GitHub репозиторій, посилання на який зазначте в LMS.

        //1. Ім'я: John, Вік: 30, Професія: Інженер
        //   Ім'я: Mary, Вік: 25, Професія: Вчитель
        //   Ім'я: Bob, Вік: 35, Професія: Лікар
        //
        //
        //2. Ім'я: Alice, Вік: 28, Професія: Архітектор
        //   (Після оновлення професії)
        //   Ім'я: Alice, Вік: 28, Професія: Дизайнер

        Person john = new Person("John", "Інженер", 30);
        Person marry = new Person("Mary", "Вчитель", 25);
        Person bob = new Person("Bob", "Лікар", 35);
        Person alice = new Person("Alice", "Архітектор", 28);

        System.out.println(john);
        System.out.println(marry);
        System.out.println(bob);

        System.out.println(alice);
        System.out.println("Після оновлення професії: ");
        alice.setProfession("Дизайнер");
        System.out.println(alice);
    }
}